src/Documents/АктПривязкиМарокЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АктПривязкиМарокЕГАИС</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.ИнвентаризацияАлкогольнойПродукцииЕГАИС</xr:Item>
				<xr:Item>Document.ПеремещениеВТорговыйЗалЕГАИС</xr:Item>
				<xr:Item>Document.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМарокЕГАИС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыОбработкиЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер акта постановки на баланс</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеВТорговыйЗалЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьНомерСправки2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Марки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйКодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СтатусыДокументовЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументовЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыОбработкиЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатусовОбработкиЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие2</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвитанцияДоставлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвитанцияВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеОРегистрацииДвижения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ДобавлениеАлкоподукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеВТорговыйЗалЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОбИмпортеПродукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ДобавлениеОрганизацииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСписанияЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПостановкиНаБалансЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПривязкиМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияАлкогольнойПродукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроверкаОстатковМарокВЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОстаткиЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОстаткиМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеГрупповойТарыЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиМарокЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМарокЕГАИС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодМарки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ИнвентаризацияАлкогольнойПродукцииЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИнвентаризацияАлкогольнойПродукцииЕГАИС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСписанияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКоэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки1ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Comment>Фактическое количество товаров на складе</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКнижн</Name>
							<Comment>Расчетное (по базе данных) количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Comment>Штрихкод</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Марки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/АктПривязкиМарокЕГАИС/Ext/ObjectModule.bsl
// Модуль объекта документа "Акт привязки марок ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

Процедура ОбработкаЗаполнения_Общая(Накладная, ТоварноТранспортнаяНакладнаяЕГАИС, ИмяОбъекта)
	
	Товары.Очистить();
	Марки.Очистить();
	
	Если Не ЗначениеЗаполнено(ТоварноТранспортнаяНакладнаяЕГАИС) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТоварноТранспортнаяНакладнаяЕГАИС", ТоварноТранспортнаяНакладнаяЕГАИС);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеШапки.Грузополучатель       КАК ОрганизацияЕГАИС,
	|	СтатусыДокументовЕГАИС.ВидСтатуса КАК ВидСтатуса
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС КАК ДанныеШапки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ПО
	|	СтатусыДокументовЕГАИС.Документ = ДанныеШапки.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &ТоварноТранспортнаяНакладнаяЕГАИС";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат
	КонецЕсли;
	
	ОрганизацияЕГАИС = Выборка.ОрганизацияЕГАИС;
	ВидСтатуса       = Выборка.ВидСтатуса;
	
	Если (НЕ ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПодтвержденСРасхождениями) И 
		(НЕ ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.Подтвержден) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВложеннаяТаблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВложеннаяТаблица.КодМарки КАК КодМарки,
	|	ВложеннаяТаблица.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ВложеннаяТаблица.Справка2 КАК Справка2
	|ПОМЕСТИТЬ СвободныеМарки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеТоваровМарки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		ПоступлениеТоваровМарки.КодМарки КАК КодМарки,
	|		ТоварноТранспортнаяНакладнаяЕГАИТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|		ТоварноТранспортнаяНакладнаяЕГАИТовары.Справка2 КАК Справка2,
	|		2 КАК ВидСвязи
	|	ИЗ
	|		Документ." + ИмяОбъекта + ".Марки КАК ПоступлениеТоваровМарки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТоварноТранспортнаяНакладнаяЕГАИТовары
	|	ПО
	|		ТоварноТранспортнаяНакладнаяЕГАИТовары.Ссылка = &ТоварноТранспортнаяНакладнаяЕГАИС И 
	|		ПоступлениеТоваровМарки.ИдентификаторСтроки = ТоварноТранспортнаяНакладнаяЕГАИТовары.ИдентификаторСтроки
	|	ГДЕ
	|		ПоступлениеТоваровМарки.Ссылка = &Ссылка И 
	|		ТоварноТранспортнаяНакладнаяЕГАИТовары.Ссылка = &ТоварноТранспортнаяНакладнаяЕГАИС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварноТранспортнаяНакладнаяЕГАИСМарки.ИдентификаторСтроки,
	|		ТоварноТранспортнаяНакладнаяЕГАИСМарки.КодМарки,
	|		ТоварноТранспортнаяНакладнаяЕГАИТовары.АлкогольнаяПродукция,
	|		ТоварноТранспортнаяНакладнаяЕГАИТовары.Справка2,
	|		1
	|	ИЗ
	|		Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Марки КАК ТоварноТранспортнаяНакладнаяЕГАИСМарки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТоварноТранспортнаяНакладнаяЕГАИТовары
	|	ПО
	|		ТоварноТранспортнаяНакладнаяЕГАИСМарки.Ссылка = ТоварноТранспортнаяНакладнаяЕГАИТовары.Ссылка
	|		И ТоварноТранспортнаяНакладнаяЕГАИСМарки.ИдентификаторСтроки = ТоварноТранспортнаяНакладнаяЕГАИТовары.ИдентификаторСтроки
	|	ГДЕ
	|		ТоварноТранспортнаяНакладнаяЕГАИСМарки.Ссылка = &ТоварноТранспортнаяНакладнаяЕГАИС) КАК ВложеннаяТаблица
	|СГРУППИРОВАТЬ ПО
	|	ВложеннаяТаблица.ИдентификаторСтроки,
	|	ВложеннаяТаблица.КодМарки,
	|	ВложеннаяТаблица.АлкогольнаяПродукция,
	|	ВложеннаяТаблица.Справка2
	|ИМЕЮЩИЕ
	|	СУММА(ВложеннаяТаблица.ВидСвязи) = 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеМарки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СвободныеМарки.КодМарки КАК КодМарки,
	|	СвободныеМарки.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ЕСТЬNULL(Справки2ЕГАИС.Ссылка, ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)) КАК Справка2
	|ИЗ
	|	СвободныеМарки КАК СвободныеМарки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Справки2ЕГАИС КАК Справки2ЕГАИС
	|		ПО (Справки2ЕГАИС.Ссылка = СвободныеМарки.Справка2)
	|ИТОГИ
	|	МАКСИМУМ(АлкогольнаяПродукция),
	|	МАКСИМУМ(Справка2)
	|ПО
	|	ИдентификаторСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Накладная);
	
	ВыборкаПоСтрокам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСтрокам.Следующий() Цикл
		
		ДобавитьСтроку = Ложь;
		
		Выборка = ВыборкаПоСтрокам.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.КодМарки) Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьСтроку = Истина;
			
			НоваяСтрокаМарки = Марки.Добавить();
			НоваяСтрокаМарки.КодМарки            = Выборка.КодМарки;
			НоваяСтрокаМарки.ИдентификаторСтроки = ВыборкаПоСтрокам.ИдентификаторСтроки;
		КонецЦикла;
		
		Если ДобавитьСтроку Тогда
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.АлкогольнаяПродукция = ВыборкаПоСтрокам.АлкогольнаяПродукция;
			НоваяСтрока.ИдентификаторСтроки  = ВыборкаПоСтрокам.ИдентификаторСтроки;
			НоваяСтрока.Справка2             = ВыборкаПоСтрокам.Справка2;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Производит заполнение объекта на основании документа "Возврат поставщику"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ВозвратОтПокупателя(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ОбработкаЗаполнения_Общая(ДанныеЗаполнения, ДанныеЗаполнения.ТоварноТранспортнаяНакладнаяЕГАИС, "ВозвратОтПокупателя");
	                         
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ВозвратОтПокупателя()

// Производит заполнение объекта на основании документа "Перемещение товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПеремещениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала Тогда
		ОбработкаЗаполнения_Общая(ДанныеЗаполнения, ДанныеЗаполнения.ТоварноТранспортнаяНакладнаяЕГАИС, "ПеремещениеТоваров");
	КонецЕсли;
		
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПеремещениеТоваров()

// Производит заполнение объекта на основании документа "Поступление товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ОбработкаЗаполнения_Общая(ДанныеЗаполнения, ДанныеЗаполнения.ТоварноТранспортнаяНакладнаяЕГАИС, "ПоступлениеТоваров");
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()

// Производит заполнение объекта на основании документа "Инвентаризация алкогольной продукции ЕГАИС"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ИнвентаризацияАлкогольнойПродукцииЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	Марки.Очистить();
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ИнвентаризацияЕГАИС Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
		Запрос.УстановитьПараметр("Ссылка",           ДанныеЗаполнения);
		Запрос.УстановитьПараметр("Момент",           ТекущаяДата());
		Если ХозОперация = Справочники.ХозОперации.АктОтвязкиМарокЕГАИС Тогда
			
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ОстаткиМарокЕГАИС.Справка2 КАК Справка2,
			|	ОстаткиМарокЕГАИС.Справка2.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
			|	ОстаткиМарокЕГАИС.Справка2.Номер КАК НомерСправкиБ,
			|	ОстаткиМарокЕГАИС.КодМарки
			|ИЗ
			|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(&Момент, ОрганизацияЕГАИС = &ОрганизацияЕГАИС И (НЕ Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка))) КАК ОстаткиМарокЕГАИС
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	Документ.Инвентаризация.Марки КАК ИнвентаризацияМарки
			|ПО
			|	ИнвентаризацияМарки.КодМарки = ОстаткиМарокЕГАИС.КодМарки И 
			|	ИнвентаризацияМарки.Ссылка = &Ссылка
			|ГДЕ
			|	ИнвентаризацияМарки.КодМарки ЕСТЬ NULL
			//И 
			//|	(НЕ ВЫРАЗИТЬ(ОстаткиМарокЕГАИС.КодМарки КАК Строка(68)) = ОстаткиМарокЕГАИС.КодМарки)
			|ИТОГИ
			|ПО
			|	ОстаткиМарокЕГАИС.Справка2
			|";
			
			ВыборкаТовары = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			СчетчикСтрок = 1;
			Пока ВыборкаТовары.Следующий() Цикл
				НоваяСтрокаТоваров = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров, ВыборкаТовары);
				НоваяСтрокаТоваров.ИдентификаторСтроки  = СчетчикСтрок;
				
				ВыборкаМарки = ВыборкаТовары.Выбрать();
				Пока ВыборкаМарки.Следующий() Цикл
					НоваяСтрокаМарок = Марки.Добавить();
					НоваяСтрокаМарок.КодМарки            = ВыборкаМарки.КодМарки;
					НоваяСтрокаМарок.ИдентификаторСтроки = СчетчикСтрок;
				КонецЦикла;
				СчетчикСтрок = СчетчикСтрок + 1;
			КонецЦикла;
			
		Иначе
			
			ХозОперация = Справочники.ХозОперации.АктПривязкиМарокЕГАИС;
			
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
			|	ВЫБОР
			|		КОГДА Справка2.АлкогольнаяПродукция ЕСТЬ NULL ТОГДА
			|			ИнвентаризацияТовары.АлкогольнаяПродукция
			|		КОГДА ИнвентаризацияТовары.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка) ТОГДА
			|			Справка2.АлкогольнаяПродукция
			|		ИНАЧЕ
			|			ИнвентаризацияТовары.АлкогольнаяПродукция
			|	КОНЕЦ КАК АлкогольнаяПродукция,
			|	ИнвентаризацияТовары.Справка2.Номер КАК НомерСправки2,
			|	Справка2.Ссылка КАК Справка2,
			|	ИнвентаризацияМарки.КодМарки
			|ПОМЕСТИТЬ
			|	ТаблицаМарок
			|ИЗ
			|	Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Марки КАК ИнвентаризацияМарки
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Товары КАК ИнвентаризацияТовары
			|ПО
			|	ИнвентаризацияТовары.Ссылка = &Ссылка И 
			|	ИнвентаризацияТовары.ИдентификаторСтроки = ИнвентаризацияМарки.ИдентификаторСтроки
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	Справочник.Справки2ЕГАИС КАК СправкиБ
			|ПО
			|	ИнвентаризацияТовары.Справка2 = СправкиБ.Ссылка
			|ГДЕ
			|	ИнвентаризацияМарки.Ссылка = &Ссылка И 
			|	(НЕ ИнвентаризацияМарки.КодМарки = """") И 
			|	НЕ ИнвентаризацияТовары.Справка2 = Значение(Справочник.Справки2ЕГАИС.ПустаяССылка)
			//|	ИнвентаризацияТовары.Справка2.ПоштучныйУчет = ИСТИНА
			|;
			|
			|ВЫБРАТЬ
			|	ТаблицаМарок.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
			|	ТаблицаМарок.НомерСправки2,
			|	ТаблицаМарок.КодМарки,
			|	ТаблицаМарок.Справка2 КАК Справка2
			|ИЗ
			|	ТаблицаМарок КАК ТаблицаМарок
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(&Момент, (КодМарки, ОрганизацияЕГАИС) В (ВЫБРАТЬ КодМарки, ОрганизацияЕГАИС ИЗ ТаблицаМарок)) КАК ОстаткиМарокЕГАИС
			|ПО
			|	ТаблицаМарок.КодМарки = ОстаткиМарокЕГАИС.КодМарки
			|ГДЕ
			|	ОстаткиМарокЕГАИС.КодМарки ЕСТЬ NULL
			|ИТОГИ
			|	МАКСИМУМ(Справка2),
			|	МАКСИМУМ(АлкогольнаяПродукция)
			|ПО
			|	ТаблицаМарок.НомерСправки2
			|";
			
			ВыборкаТовары = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			СчетчикСтрок = 1;
			Пока ВыборкаТовары.Следующий() Цикл
				НоваяСтрокаТоваров = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров, ВыборкаТовары);
				НоваяСтрокаТоваров.ИдентификаторСтроки  = СчетчикСтрок;
				
				ВыборкаМарки = ВыборкаТовары.Выбрать();
				Пока ВыборкаМарки.Следующий() Цикл
					НоваяСтрокаМарок = Марки.Добавить();
					НоваяСтрокаМарок.КодМарки            = ВыборкаМарки.КодМарки;
					НоваяСтрокаМарок.ИдентификаторСтроки = СчетчикСтрок;
				КонецЦикла;
				СчетчикСтрок = СчетчикСтрок + 1;
			КонецЦикла;
			
		Конецесли;
		
	Конецесли;

	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()

// Производит заполнение объекта на основании документа "Инвентаризация алкогольной продукции ЕГАИС"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПеремещениеВТорговыйЗалЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	Марки.Очистить();
	
	ХозОперация = Справочники.ХозОперации.АктПривязкиМарокЕГАИС;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",           ДанныеЗаполнения.Дата);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("Ссылка",           ДанныеЗаполнения);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТовары.АлкогольнаяПродукция,
	|	ТаблицаТовары.Справка2 КАК Справка2,
	|	ТаблицаТовары.ИдентификаторСтроки,
	|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	&Период КАК Период,
	|	ТаблицаМарки.КодМарки
	|ПОМЕСТИТЬ
	|	ТаблицаМарки
	|ИЗ
	|	Документ.ПеремещениеВТорговыйЗалЕГАИС.Товары КАК ТаблицаТовары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ПеремещениеВТорговыйЗалЕГАИС.Марки КАК ТаблицаМарки
	|ПО
	|	ТаблицаТовары.Ссылка = ТаблицаМарки.Ссылка И 
	|	ТаблицаТовары.ИдентификаторСтроки = ТаблицаМарки.ИдентификаторСтроки
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаМарки.АлкогольнаяПродукция,
	|	ТаблицаМарки.Справка2 КАК Справка2,
	|	ТаблицаМарки.ИдентификаторСтроки,
	|	ТаблицаМарки.КодМарки
	|ИЗ
	|	ТаблицаМарки КАК ТаблицаМарки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиМарокЕГАИС КАК ОстаткиМарокЕГАИС
	|ПО
	|	ТаблицаМарки.КодМарки = ОстаткиМарокЕГАИС.КодМарки И 
	|	ТаблицаМарки.ОрганизацияЕГАИС = ОстаткиМарокЕГАИС.ОрганизацияЕГАИС И 
	|	ТаблицаМарки.Период < ОстаткиМарокЕГАИС.Период
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаМарки.АлкогольнаяПродукция,
	|	ТаблицаМарки.Справка2,
	|	ТаблицаМарки.ИдентификаторСтроки,
	|	ТаблицаМарки.КодМарки
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиМарокЕГАИС.ВидДвижения ЕСТЬ NULL ТОГДА
	|			0
	|		КОГДА ОстаткиМарокЕГАИС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			1
	|		ИНАЧЕ
	|			-1
	|	КОНЕЦ)>=0
	|ИТОГИ
	|	МАКСИМУМ(АлкогольнаяПродукция),
	|	МАКСИМУМ(Справка2)
	|ПО
	|	ИдентификаторСтроки
	|";
	
	ВыборкаСтрока = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтрока.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.АлкогольнаяПродукция = ВыборкаСтрока.АлкогольнаяПродукция;
		НоваяСтрока.ИдентификаторСтроки  = ВыборкаСтрока.ИдентификаторСтроки;
		НоваяСтрока.Справка2             = ВыборкаСтрока.Справка2;
		Выборка = ВыборкаСтрока.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрокаМарки = Марки.Добавить();
			НоваяСтрокаМарки.ИдентификаторСтроки = Выборка.ИдентификаторСтроки;
			НоваяСтрокаМарки.КодМарки            = Выборка.КодМарки;
		КонецЦикла;
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПеремещениеВТорговыйЗалЕГАИС()

// Производит заполнение объекта на основании документа "Инвентаризация алкогольной продукции ЕГАИС"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяВходящаяЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ХозОперация = Справочники.ХозОперации.АктПривязкиМарокЕГАИС;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТоварноТранспортнаяНакладнаяЕГАИС", ДанныеЗаполнения);
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеТоваров.Ссылка,
	|	""ПоступлениеТоваров"" КАК ИмяОбъекта,
	|	ПоступлениеТоваров.Дата КАК ДатаДок
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Проведен = ИСТИНА И 
	|	ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ И 
	|	ПоступлениеТоваров.ТоварноТранспортнаяНакладнаяЕГАИС = &ТоварноТранспортнаяНакладнаяЕГАИС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеТоваров.Ссылка,
	|	""ПеремещениеТоваров"",
	|	ПоступлениеТоваров.Дата
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Проведен = ИСТИНА И 
	|	ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ И 
	|	ПоступлениеТоваров.ТоварноТранспортнаяНакладнаяЕГАИС = &ТоварноТранспортнаяНакладнаяЕГАИС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеТоваров.Ссылка,
	|	""ВозвратОтПокупателя"",
	|	ПоступлениеТоваров.Дата
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Проведен = ИСТИНА И 
	|	ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ И 
	|	ПоступлениеТоваров.ТоварноТранспортнаяНакладнаяЕГАИС = &ТоварноТранспортнаяНакладнаяЕГАИС
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДок УБЫВ
	|";
	
	Товары.Очистить();
	Марки.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		ОбработкаЗаполнения_Общая(Выборка.Ссылка, ДанныеЗаполнения, Выборка.ИмяОбъекта);
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ХозОперация") Тогда
		
		ХозОперация =  ДанныеЗаполнения.ХозОперация;
		ДанныеЗаполнения = ДанныеЗаполнения.Основание;
		
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	Марки.Очистить();

КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = СокрЛП(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСтатусДокументаЕГАИСПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.АктПривязкиМарокЕГАИС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиМарокЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиМарокЕГАИС, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры // ОбработкаПроведения()

#КонецЕсли
